# 전자제조데이터분석 과제 02
## 제출: eclass 과제메뉴 02
- 각 코드 블럭의 출력 결과까지 저장하여 제출해주세요.
- 최대한 본인의 힘으로 해결하세요. (중간고사과 유사한 스타일)
- 각 코드의 동작방식을 반드시! 주석으로 설명해주세요.
- ipynb 파일을 그대로 제출해주세요.

##기한: 2021.10.23 23:59

학번: 21510004
이름: 이예빈

참고해야 할 문서: Padnas API Reference 

https://pandas.pydata.org/pandas-docs/version/1.1.5/reference/index.html

팁:
- read_csv(): csv 파일을 읽기 위한 메소드 (https://pandas.pydata.org/pandas-docs/version/1.1.5/reference/api/pandas.read_csv.html#pandas.read_csv)
- dataframe.*: dataframe을 다루기 위한 다양한 메소드 (https://pandas.pydata.org/pandas-docs/version/1.1.5/reference/frame.html)



### Step 1. pandas 모듈을 import 하세요.

In [1]:
# pandas 모듈을 alias를 사용하여 pd로 불러오기
import pandas as pd

### Step 2. 제공된 데이터 파일을 업로드하세요.

런타임 재활용되면 데이터 다시 업로드 해야함!!

### Step 3. 업로드한 파일을 읽어 dataframe을 추출한 후 (pd.read_csv() 활용), 특정 변수에 저장하세요. 이때, 'user_id' 열을 dataframe의 인덱스로 활용하세요.

In [2]:
# 'user_id'를 인덱스로 활용하기 위해 index_col 옵션을 사용하여 지정
data = pd.read_csv('w6data.txt', index_col = 'user_id')

### Step 4. 첫 25개 항목을 출력하세요.

In [3]:
# 첫 25개 항목을 추출하기 위해 head 안에 숫자(25) 지정 -> DataFrame.head([n]): Return the first n rows.
data.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. 마지막 10개 항목을 출력하세요.

In [4]:
# 마지막 10개 항목을 추출하기 위해 tail 안에 숫자(10) 지정 -> DataFrame.tail([n]): Return the last n rows.
data.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. 데이터 파일에 총 몇개의 항목이 존재하는지 구해보세요.

In [5]:
# 데이터 파일 안 총 항목의 개수를 구하는 방식은 여러가지가 있음 (len함수, shape함수 모두 같은 값 출력)
len(data)

943

In [6]:
# shape의 첫번째 값 = 데이터 항목(row) 수 -> DataFrame.shape: Return a tuple representing the dimensionality of the DataFrame. (행, 열)
data.shape[0]

943

### Step 7. Dataframe에 몇 개의 열(column)이 존재하나요?

In [7]:
# 데이터 파일 안 총 열의 수를 구하는 방식은 여러가지가 있음 (len함수, shape함수 모두 같은 값 출력)
len(data.columns)

4

In [8]:
# shape의 두번째 값 = 데이터 열(column) 수 -> DataFrame.shape: Return a tuple representing the dimensionality of the DataFrame. (행, 열)
data.shape[1]

4

### Step 8. Dataframe 내 모든 열(column)의 이름을 출력해보세요.

In [9]:
# 데이터프레임 내 모든 열을 출력 -> DataFrame.columns: The column labels of the DataFrame.
data.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. Dataframe의 인덱싱이 어떻게 되어있는지 출력해보세요.

In [10]:
# "the index" (aka "the labels")
# 데이터프레임 index 출력 -> DataFrame.index: The index (row labels) of the DataFrame.
data.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 10. 각 열(column)의 data type을 출력해보세요.

In [11]:
# 각 열의 data type 출력 -> DataFrame.dtypes: Return the dtypes in the DataFrame.
data.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. occupation 열(column)만 출력해보세요.

In [12]:
# occupation 열 지정, 방법1 -> []안에 열이름 입력
data['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [13]:
# occupation 열 지정, 방법2 -> .열이름으로 불러오기
data.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. 데이터 파일에 몇 개의 서로 다른 occupation이 존재하나요?

In [14]:
# occupation 열의 고유한 값 개수 세기 -> DataFrame.nunique([axis, dropna]): Count distinct observations over requested axis.
data['occupation'].nunique()

21

### Step 13. 가장 많이 등장하는 occupation은 무엇인가요?

In [15]:
# occupation 열의 개수 세기 -> DataFrame.value_counts([subset, normalize, …]): Return a Series containing counts of unique rows in the DataFrame.
# ascending 옵션의 default 값이 False 이므로 처음 index 가 가장 많이 등장하는 occupation을 의미함
data['occupation'].value_counts().index[0]

'student'

### Step 14. Dataframe내 모든 열(column)에 대하여 다양한 통계정보를 출력해보세요.

In [16]:
# 데이터프레임의 통계 정보 추출 -> DataFrame.describe([percentiles, include, …]): Generate descriptive statistics.
# 모든 열을 출력하기 위해 include 옵션에 'all'지정
data.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 15. 사용자들의 평균 나이는 몇살인가요?

In [17]:
# 데이터프레임에서 평균 구하기 -> DataFrame.mean([axis, skipna, level, …]): Return the mean of the values for the requested axis.
# 정수로 표현하기 위해 round(반올림) 함수 사용
round(data['age'].mean())

34

### Step 16. 가장 적게 등장한 사용자들 중 최연소자의 나이는 몇인가요?

In [18]:
# 가장 적게 등장한 사용자 나이 (사용자의 나이는 중복 존재할 수 있으므로) 중 최연소 나이

# age 열의 개수 세기
age = data['age'].value_counts()

In [19]:
age

30    39
25    38
22    37
28    36
27    35
      ..
11     1
10     1
73     1
66     1
7      1
Name: age, Length: 61, dtype: int64

In [20]:
# age 열에서 가장 적게 등장한 경우 less_appear에 저장
less_appear = []
for i in range(len(age)):
  if age.values[i] == age.values.min():
    less_appear.append(age.index[i])

In [21]:
less_appear

[11, 10, 73, 66, 7]

In [22]:
# 가장 적게 등장한 사용자 나이 중 최연소 나이 값 추출
min(less_appear)

7